verification/runs/F14-cooling-ladder/KV1_runs/KV1c_duct_heated/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.00000 0.00000 0.00000)
    (0.30000 0.00000 0.00000)
    (0.00000 0.05000 0.00000)
    (0.30000 0.05000 0.00000)
    (0.00000 0.00000 0.01000)
    (0.30000 0.00000 0.01000)
    (0.00000 0.05000 0.01000)
    (0.30000 0.05000 0.01000)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (60 20 1) simpleGrading (1 1 1)
);

edges();

boundary
(
    inlet
    {
        type patch;
        faces ( (0 4 6 2) );
    }
    outlet
    {
        type patch;
        faces ( (1 3 7 5) );
    }
    hotWall
    {
        type wall;
        faces ( (0 1 5 4) );
    }
    topWall
    {
        type wall;
        faces ( (2 6 7 3) );
    }
    frontAndBack
    {
        type empty;
        faces ( (0 2 3 1) (4 5 7 6) );
    }
);

// ************************************************************************* //
